import React from 'react'
import { useNavigate } from 'react-router-dom'

import '../styles/SucessfullApplication.css'

const SucessfullApplication = () => {

    const navigate = useNavigate()

    return (
        <div className='SucessfullApplicationWrapper'>
            <div className='iconBagWrapper'>
                <svg width="77" height="88" viewBox="0 0 77 88" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path fill-rule="evenodd" clip-rule="evenodd" d="M52.25 19.25C52.25 15.6033 50.8013 12.1059 48.2227 9.52728C45.6441 6.94866 42.1467 5.5 38.5 5.5C34.8533 5.5 31.3559 6.94866 28.7773 9.52728C26.1987 12.1059 24.75 15.6033 24.75 19.25V22H52.25V19.25ZM57.75 19.25V22H77V77C77 79.9174 75.8411 82.7153 73.7782 84.7782C71.7153 86.8411 68.9174 88 66 88H11C8.08262 88 5.28473 86.8411 3.22183 84.7782C1.15893 82.7153 0 79.9174 0 77V22H19.25V19.25C19.25 14.1446 21.2781 9.24827 24.8882 5.63819C28.4983 2.02812 33.3946 0 38.5 0C43.6054 0 48.5017 2.02812 52.1118 5.63819C55.7219 9.24827 57.75 14.1446 57.75 19.25ZM54.197 48.697C54.7134 48.1806 55.0035 47.4803 55.0035 46.75C55.0035 46.0197 54.7134 45.3194 54.197 44.803C53.6806 44.2866 52.9803 43.9965 52.25 43.9965C51.5197 43.9965 50.8194 44.2866 50.303 44.803L35.75 59.3615L29.447 53.053C29.1913 52.7973 28.8878 52.5945 28.5537 52.4561C28.2196 52.3177 27.8616 52.2465 27.5 52.2465C27.1384 52.2465 26.7804 52.3177 26.4463 52.4561C26.1122 52.5945 25.8087 52.7973 25.553 53.053C25.2973 53.3087 25.0945 53.6122 24.9561 53.9463C24.8177 54.2804 24.7465 54.6384 24.7465 55C24.7465 55.3616 24.8177 55.7196 24.9561 56.0537C25.0945 56.3878 25.2973 56.6913 25.553 56.947L33.803 65.197C34.0585 65.4531 34.3619 65.6563 34.696 65.7949C35.0301 65.9336 35.3883 66.0049 35.75 66.0049C36.1117 66.0049 36.4699 65.9336 36.804 65.7949C37.1381 65.6563 37.4415 65.4531 37.697 65.197L54.197 48.697Z" fill="#9CA0AB"/>
                </svg>
            </div>
            <h1 className='titleSucessfullApplication'>Заявка успешно отправлена!</h1>
            <div className='greetingSucessfullApplication'>Спасибо за заявку, скоро с вами свяжется наш менеджер</div>
            <div className='btnToMainPage' onClick={() => navigate("/")}>
                <div>
                    На главную
                </div>
            </div>
        </div>
    )

}

export default SucessfullApplication